<a href="https://colab.research.google.com/github/Alxsoa/Alexandre-Soares/blob/main/DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
import pandas as pd
import numpy as np

In [2]:
#
#######################################################################
# Criando as Colunas
#######################################################################
#

ColunaA = [ 1, 2, 3, 4]
ColunaB = [ 2, 4, 6, 8]
ColunaC = [ 3, 6, 9, 12 ]
ColunaD = [ 4, 8, 12, 16 ]

In [3]:
#
#######################################################################
# Criando o DataFrame
#######################################################################
#
df = pd.DataFrame ( [ColunaA, ColunaB, ColunaC, ColunaD], index=list("abcd"), columns=list("ABCD") )

In [4]:
#
#######################################################################
# Listando o Resultado
#######################################################################
#
df

   A  B   C   D
a  1  2   3   4
b  2  4   6   8
c  3  6   9  12
d  4  8  12  16

In [5]:
#
#######################################################################
# Criando Mais uma Coluna (Similar a uma celula do excell)
#######################################################################
#
df['E'] = df['A'] * df['B']
df

   A  B   C   D   E
a  1  2   3   4   2
b  2  4   6   8   8
c  3  6   9  12  18
d  4  8  12  16  32

In [6]:
#
#######################################################################
# Criando Mais uma Coluna (Com Valores Nulos)
#######################################################################
#
df['F'] = 0
df

   A  B   C   D   E  F
a  1  2   3   4   2  0
b  2  4   6   8   8  0
c  3  6   9  12  18  0
d  4  8  12  16  32  0

In [7]:
#
#######################################################################
# Criando o de Outra Forma (Dicionario)
#######################################################################
#
df = pd.DataFrame ( { 'A': [ 1, 2,  3,  4],
                      'B': [ 2, 4,  6,  8],
                      'C': [ 3, 6,  9, 12],
                      'D': [ 4, 8, 18, 32]},  index=list("abcd")) 
df

   A  B   C   D
a  1  2   3   4
b  2  4   6   8
c  3  6   9  18
d  4  8  12  32

In [8]:
#
#######################################################################
# Criando o de Outra Forma (Dicionario)
#######################################################################
#
df1 = pd.DataFrame ({ 'A': [  1,  2,  3,  4],
                      'B': [  2,  4,  6,  8],
                      'C': [  3,  6,  9, 12],
                      'D': [  4,  8, 18, 16]}, index=list("abcd") )
df2 = pd.DataFrame ({ 'A': [  5,  6,  7,  8],
                      'B': [ 10, 12, 14, 16],
                      'C': [ 15, 18, 21, 24],
                      'D': [ 20, 24, 28, 32]}, index=list("efgh") )

In [9]:
df1

   A  B   C   D
a  1  2   3   4
b  2  4   6   8
c  3  6   9  18
d  4  8  12  16

In [10]:
df2

   A   B   C   D
e  5  10  15  20
f  6  12  18  24
g  7  14  21  28
h  8  16  24  32

In [11]:
#
#######################################################################
# Concatenando Dicionarios
#######################################################################
#
df3 = pd.concat([df1,df2])
df3

   A   B   C   D
a  1   2   3   4
b  2   4   6   8
c  3   6   9  18
d  4   8  12  16
e  5  10  15  20
f  6  12  18  24
g  7  14  21  28
h  8  16  24  32

In [12]:
#
#######################################################################
# Criando um DataFrame apartir de Outro
#######################################################################
#
df4 = pd.DataFrame([df3['A'],df3['B']]) #,df3['C'],df3['D']])
df4 = df4.T
df4

   A   B
a  1   2
b  2   4
c  3   6
d  4   8
e  5  10
f  6  12
g  7  14
h  8  16

In [13]:
#
#######################################################################
# MERGE DE DataFrames
#######################################################################
#

In [14]:
#
#######################################################################
# Loja A
#######################################################################
#
Cadastro_A =  { 
                'Id'    : [ 'AA2930', 'B84563', 'CC2139', 'DE2521', 'GT3462', 'HH1158'],
                'Nome'  : [ 'Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
                'Idade' : [ 20, 35, 40, 54, 30, 27 ],
                'CEP'   : [ '00092-029', '11111-111', '22222-888', '00000-999', '88888-111', '77777-666']
              }
Cadastro_A = pd.DataFrame ( Cadastro_A, columns = [ 'Id', 'Nome', 'Idade', 'CEP'])              
Cadastro_A

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  B84563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [19]:
#
#######################################################################
# Loja B
#######################################################################
#
Cadastro_B =  { 
                'Id'    : [ 'CC9999', 'EF4488', 'DD9999', 'GT3462', 'HH1158' ],
                'Nome'  : [ 'Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria' ],
                'Idade' : [ 19, 0, 22, 30, 27 ],
                'CEP'   : [ '00092-029', '11111-111', '11111-888', '88888-111', '77777-666']
              }
Cadastro_B = pd.DataFrame ( Cadastro_B, columns = [ 'Id', 'Nome', 'Idade', 'CEP'])              
Cadastro_B

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia      0  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [20]:
#
#######################################################################
# Compras
#######################################################################
#
Compras =  { 
                'Id'    : [ 'AA2930',     'EF4488',     'CC2139',     'EF4488',     'CC9999',     'AA2930',     'HH1158',     'HH1158' ],
                'Data'  : [ '2019-01-01', '2019-01-30', '2019-01-30', '2019-02-01', '2019-02-20', '2019-03-15', '2019-04-01', '2019-04-10'],
                'Valor' : [ 200, 100, 40, 150, 300, 25, 50, 500 ],
                'CEP'   : [ '00092-029', '11111-111', '11111-888', '88888-111', '77777-666']
           }
Compras = pd.DataFrame ( Compras, columns = [ 'Id', 'Data', 'Valor'])              
Compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [21]:
#
#######################################################################
# Intercesão de clientes
#######################################################################
#
Intercesao = pd.merge(Cadastro_A, Cadastro_B, on=['Id'], how='inner')
Intercesao

       Id   Nome_x  Idade_x      CEP_x   Nome_y  Idade_y      CEP_y
0  GT3462  Ricardo       30  88888-111  Ricardo       30  88888-111
1  HH1158    Maria       27  77777-666    Maria       27  77777-666

In [28]:
#
#######################################################################
# Intercesão de clientes - Filtragem
#######################################################################
#
Filtro = pd.merge(Cadastro_A, Cadastro_B[['Id','Idade', 'CEP']], on=['Id'], how='inner',suffixes=('_A','_B'))
Filtro

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

In [31]:
#
#######################################################################
# Juncao de Dados
#######################################################################
#
Lojas = pd.concat([Cadastro_A, Cadastro_B], ignore_index=True)
Lojas

        Id      Nome  Idade        CEP
0   AA2930    Victor     20  00092-029
1   B84563    Amanda     35  11111-111
2   CC2139     Bruna     40  22222-888
3   DE2521    Carlos     54  00000-999
4   GT3462   Ricardo     30  88888-111
5   HH1158     Maria     27  77777-666
6   CC9999    Marcos     19  00092-029
7   EF4488  Patricia      0  11111-111
8   DD9999    Ericka     22  11111-888
9   GT3462   Ricardo     30  88888-111
10  HH1158     Maria     27  77777-666

In [33]:
#
#######################################################################
# Removendo Duplicatas
#######################################################################
#
Clientes_Unicos = Lojas.drop_duplicates(subset='Id')
Clientes_Unicos

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  B84563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia      0  11111-111
8  DD9999    Ericka     22  11111-888

In [35]:
#
#######################################################################
# Left Join
#######################################################################
#
ComprasClientes_A = pd.merge(Cadastro_A, Compras, on=['Id'], how='left')
ComprasClientes_A

       Id     Nome  Idade        CEP        Data  Valor
0  AA2930   Victor     20  00092-029  2019-01-01  200.0
1  AA2930   Victor     20  00092-029  2019-03-15   25.0
2  B84563   Amanda     35  11111-111         NaN    NaN
3  CC2139    Bruna     40  22222-888  2019-01-30   40.0
4  DE2521   Carlos     54  00000-999         NaN    NaN
5  GT3462  Ricardo     30  88888-111         NaN    NaN
6  HH1158    Maria     27  77777-666  2019-04-01   50.0
7  HH1158    Maria     27  77777-666  2019-04-10  500.0

In [38]:
#
#######################################################################
# Agrupamento
#######################################################################
#
ComprasClientes_A.groupby(['Id','Nome'])['Valor'].sum()

Id      Nome
AA2930  Victor     225.0
B84563  Amanda       0.0
CC2139  Bruna       40.0
DE2521  Carlos       0.0
GT3462  Ricardo      0.0
HH1158  Maria      550.0
Name: Valor, dtype: float64

In [41]:
#
#######################################################################
# OUTER
#######################################################################
#
pd.merge(Cadastro_A, Cadastro_B, how='outer', on=['Id'], indicator=True)

       Id   Nome_x  Idade_x  ... Idade_y      CEP_y      _merge
0  AA2930   Victor     20.0  ...     NaN        NaN   left_only
1  B84563   Amanda     35.0  ...     NaN        NaN   left_only
2  CC2139    Bruna     40.0  ...     NaN        NaN   left_only
3  DE2521   Carlos     54.0  ...     NaN        NaN   left_only
4  GT3462  Ricardo     30.0  ...    30.0  88888-111        both
5  HH1158    Maria     27.0  ...    27.0  77777-666        both
6  CC9999      NaN      NaN  ...    19.0  00092-029  right_only
7  EF4488      NaN      NaN  ...     0.0  11111-111  right_only
8  DD9999      NaN      NaN  ...    22.0  11111-888  right_only

[9 rows x 8 columns]

In [44]:
#
#######################################################################
# Criando DtaFrame
#######################################################################
#

df =     pd.DataFrame  ( 
                          {
                              'A' : ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                              'B' : [ 'um', 'um', 'dois', 'tres', 'dois', 'dois', 'um', 'tres'],
                              'C' : np.random.randn (8),
                              'D' : np.random.randn (8)
                          }
                        )              
df

            A     B         C         D
0  verdadeiro    um  0.226674 -1.256080
1       falso    um -0.233718  0.179932
2  verdadeiro  dois -1.410746 -0.581367
3       falso  tres  0.321025 -0.212010
4  verdadeiro  dois  0.248275  0.913609
5       falso  dois -2.603329 -0.692281
6  verdadeiro    um -0.875566 -1.272113
7       falso  tres -0.996366  1.445244

In [45]:
#
#######################################################################
# Somando um Grupo
#######################################################################
#
df.groupby(['A']).sum()

                   C         D
A
falso      -3.512387  0.720884
verdadeiro -1.811362 -2.195951

In [46]:
df.groupby(['A']).mean()

                   C         D
A
falso      -0.878097  0.180221
verdadeiro -0.452841 -0.548988

In [47]:
df.groupby(['B']).sum()

             C         D
B
dois -3.765800 -0.360040
tres -0.675341  1.233234
um   -0.882609 -2.348260

In [49]:
df.groupby(['A','B']).sum()

                        C         D
A          B
falso      dois -2.603329 -0.692281
           tres -0.675341  1.233234
           um   -0.233718  0.179932
verdadeiro dois -1.162471  0.332242
           um   -0.648892 -2.528192